/**
  *******************************  STM8L151K4  *********************************
  * @文件名     ： Main.c
  * @作者       ： 佘晓凯
  * @库版本     ： V1.6.1
  * @文件版本   ： V1.0.0
  * @日期       ： 2018年05月09日
  * @摘要       ： 主函数
  ******************************************************************************/
/*----------------------------------------------------------------------------
  更新日志:
  2018-05-09 V1.0.0:初始版本
  ----------------------------------------------------------------------------*/
/* 包含的头文件 --------------------------------------------------------------*/
#include "Main.h"
/* 全局变量 ------------------------------------------------------------------*/


/************************************************
函数名称 ： main
功    能 ： 主函数
参    数 ： 
返 回 值 ： 无
作    者 ： 佘晓凯
摘    要 ： 
*************************************************/	

int main ()
{
	inline void Init(void);
  
  	Init();
  	//GPIO_Write(GPIOB,0xFF);
  	//GPIO_ResetBits(GPIOD,GPIO_Pin_4,);
	
	asm("rim");//降低主函数优先级，即总中断使能
  	while(1);
}
 
/************************************************
函数名称 ： Init
功    能 ： 初始化
作    者 ： 佘晓凯
*************************************************/	
void Init(void)
{
	inline void Clock_Init(void);
	inline void Seg_Gpio_Init(void);
	Clock_Init();
	Seg_Init();//数码管初始化 
	TM7705_Init();
}


/************************************************
函数名称 ： Clock_Init
功    能 ： 时钟初始化
作    者 ： 佘晓凯
摘    要 ： 主频1M,CCO输出1M
*************************************************/	
void Clock_Init(void)
{
  
  	
  	CLK_SYSCLKDivConfig(CLK_SYSCLKDiv_16);//CPU时钟16分频
	
	CLK_CCOConfig(CLK_CCOSource_HSI,CLK_CCODiv_16);
	//HSI作为CCO时钟源，16分频，1M输出
	CLK_PeripheralClockConfig(CLK_Peripheral_TIM2,ENABLE);
	//TIM2时钟使能
	GPIO_Init(GPIOC,GPIO_Pin_4,GPIO_Mode_Out_PP_Low_Slow);
	
}

//根据汇编大致估算，没有测试过
void Delay(u32 time)
{
  	time*=3;
  	while(time--);
}


	

	
	